import sys
sys.stdin = open("input.txt", "rt")


# a의 1,2,3,4승을 담은 리스트를 만든다. b는 예를 들어 3이 , a는 2이 들어온다 가정.
# 그러면 [2,4,8,6] 리스트에서 b-1 인덱스를 출력하면 될것이다
# b값이 4를 넘을 수도 있다. 그런경우 예를 들어 2의 7승이라면 7을 4로 나눔의 나머지가 3이다.
# 10인경우 4의 나머지가 2이다. 따라서 (b%4)-1인덱스를 출력하면 된다.

# 예외 신경 안써서 한번 더 오답났다. 만약 데이터가 10개라면 10번 컴퓨터에서 처리한다. 0번 컴퓨터는 없다;
N = int(input())

for i in range(N):
    a, b = map(int, input().split())
    ans = [(a**i) % 10 for i in range(1,4+1)][b%4-1]
    print(ans if ans!=0 else 10)

'''
1을 계속 제곱하면 언제나 1
2를 계속 제곱하면 제곱값의 1의 자리 수는 2,4 8,6, 2....__annotations__
3을 계속.. 3,9,7,1, 3...
4는 4, 6, 4... <두 수가 반복됨>
5는 언제나 5
6은 언제나 6
7은 7, 9, 3, 1, 7..
전부 다 4개 이하의 숫자들이 반복될 것이라 생각된다.
'''